---
kind: other
id: Events.T:Autodesk.Revit.UI.UIControlledApplication
source: html/418cd49d-9c2f-700f-3db2-fcbe8929c5e5.htm
---
# UIControlledApplication Events

Subscribe to the ApplicationClosing event to be notified when the Revit application is just about to be closed.